RhinoInside.Revit API Documentation
RectangleConverter.ToRectangle Method (Rectangle)
 Converts the specified Rectangle to an equivalent Autodesk.Revit.DB.Rectangle.
 Namespace: RhinoInside.Revit.Convert.System.Drawing
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8018
Syntax
public static Autodesk.Revit.DB.Rectangle ToRectangle(
	this Rectangle value
)
Parameters
value
Type: System.Drawing.Rectangle
A value to convert.
Return Value
Type: Autodesk.Revit.DB.Rectangle
A Autodesk.Revit.DB.Rectangle that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rectangle. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
RectangleConverter Class
ToRectangle Overload
RhinoInside.Revit.Convert.System.Drawing Namespace